// #qLQLJSeN7i
// - є масив [2,17,13,6,22,31,45,66,100,-18] :
// 1. перебрати його циклом while
// 2. перебрати його циклом for
// 3. перебрати циклом while та вивести числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)



let arr = [2,17,13,6,22,31,45,66,100,-18];

// 1. while

// let i = 0;
//
// while (i < arr.length) {
//     console.log(arr[i]);
//     i++;
// }


// 2.  for

//
// for(let i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }


// 3.перебрати циклом while та вивести числа тільки з непарним індексом

// let i = 0;
//
// while(i < arr.length) {
//     if(i % 2 !== 0) {
//         console.log(arr[i]);        // 17 13 31 45
//     }
//     i++;
// }



// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// let arr = [2,17,13,6,22,31,45,66,100,-18];

// for(let i = 0; i < arr.length; i++) {
//     if(i % 2 !== 0) {
//         console.log(arr[i]);
//     }
// }


// 5. перебрати циклом while та вивести числа тільки парні значення

// let i = 0;
//
// while (i < arr.length) {
//     if(i % 2 === 0) {
//         console.log(arr[i]);
//     }
//     i++;
// }

// 6. перебрати циклом for та вивести  числа тільки парні  значення

// for(let i = 0; i < arr.length; i++) {
//     if(i % 2 === 0) {
//         console.log(arr[i]);
//     }
// }


// 7. замінити кожне число кратне 3 на слово "okten"

// let arr = [2,17,13,6,22,31,45,66,100,-18];

// for(let i = 0; i < arr.length; i++) {
//     if(arr[i] % 3 === 0) {
//         arr[i] = 'okten';
//     }
// }
//
// console.log(arr);

// 8. вивести масив в зворотньому порядку.

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let reversedArr = [];
//
// for(let i = arr.length - 1; i >= 0; i--) {
//     reversedArr.push(arr[i]);
// }
//
// console.log(reversedArr);





// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед) =========================

// let arr = [2,17,13,6,22,31,45,66,100,-18];

// 1. перебрати його циклом while

// let i = arr.length - 1;
//
// while (i >= 0) {
//     console.log(arr[i]);
//     i--;
// }


// 2. перебрати його циклом for

// let arr = [2,17,13,6,22,31,45,66,100,-18];

// for(let i = arr.length - 1; i >= 0; i--) {
//     console.log(arr[i]);
// }


// 3. перебрати циклом while та вивести числа тільки з непарним індексом

// let i = arr.length - 1;
//
// while (i >= 0) {
//     if(i % 2 !== 0) {
//         console.log(arr[i]);
//     }
//     i--;
// }


// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// for(let i = arr.length - 1; i>=0; i--) {
//     if(i % 2 !== 0) {
//         console.log(arr[i]);
//     }
// }


// 5. перебрати циклом while та вивести числа тільки парні значення

// let i = arr.length - 1;
//
// while(i >= 0) {
//     if(arr[i] % 2 === 0){
//         console.log(arr[i]);
//     }
//     i--;
// }


// 6. перебрати циклом for та вивести числа тільки парні значення

// let arr = [2,17,13,6,22,31,45,66,100,-18];

// for(let i = arr.length - 1; i >=0; i--) {
//     if(arr[i] % 2 === 0) {
//         console.log(arr[i]);
//     }
// }


// 7. замінити кожне число кратне 3 на слово "okten"

// let arr = [2,17,13,6,22,31,45,66,100,-18];

// [ -18, 100, 66, 45, 31, 22, 6, 13, 17, 2 ]

let reversedArr = [];

for(let i = arr.length - 1; i >= 0; i--) {
    if(arr[i] % 3 === 0) {
        reversedArr.push('okten');
    } else {
        reversedArr.push(arr[i]);
    }
}
console.log(reversedArr);